20250314T213044--kdoc-343-『tidy-first』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:19Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 343: 『Tidy First?』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 343: 『Tidy First?』</h1>
<div id="outline-container-orga7612bf" class="outline-2">
<h2 id="orga7612bf"><a href="#orga7612bf">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orga7612bf">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-04-28 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-07 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org27f284d" class="outline-2">
<h2 id="org27f284d"><a href="#org27f284d">概要</a></h2>
<div class="outline-text-2" id="text-org27f284d">
<p>
<code>『Tidy First?』</code> はリファクタリング前の、小さなコードの改善について書かれた本。
</p>
</div>
</div>
<div id="outline-container-org9e14221" class="outline-2">
<h2 id="org9e14221"><a href="#org9e14221">メモ</a></h2>
<div class="outline-text-2" id="text-org9e14221">
<ul class="org-ul">
<li>2つの端
<ul class="org-ul">
<li>推測的設計: 最初にすべてを設計する</li>
<li>反応的設計: 必要になってから設計する</li>
</ul></li>
<li>自分が呼びたいインターフェースを実装して呼び出す。新しいインターフェースは単に古いインターフェースを呼ぶ。すべて移行できたら、そのあとで実装をインライン化する</li>
<li>ファイル中のコードを読みてが遭遇したいと考える順番に並び替える</li>
<li>パラメータのかたまりをマップで渡すことはよくあるが、どんなデータが必要なのかを読み取るのが難しくなる</li>
<li>自動リファクタリングツールを使う</li>
<li>整頓とふるまいの変更を切り替えるたびに新しいプルリクエストを作る</li>
<li>ゴルディロックスのジレンマ</li>
<li>設計者は要素を役立つように関係付ける
<ul class="org-ul">
<li>要素の作成と削除</li>
<li>関係性の作成と削除</li>
<li>関係性が生み出す利益の増加</li>
</ul></li>
<li>システムの構造
<ul class="org-ul">
<li>要素の階層</li>
<li>要素間の関係性</li>
<li>その関係性から生まれる利益</li>
</ul></li>
<li>ハイゼンベルクの不確定性定理</li>
<li>オプショナリティを高めることを覚えるにつれ、カオスは絶好の機会だととらえるようになった</li>
<li>構造は振る舞いのようにわかりやすくはない。プロダクトロードマップが機能のリストになっているのはわかりやすいからだ</li>
<li>構造に投資してオプショナリティを維持し拡張することが必要である</li>
<li>構造の変更と振る舞いの変更はどちらも価値を生み出すが、可逆性という面で別物である</li>
<li>『マネーの意味論』</li>
<li>カオスな状況では、モノよりオプションのほうが優れている。不確実性に対してオプションを作る</li>
<li>お金の時間価値が推奨しているのは、先に整頓するよりもあとに整頓するほう(ときには先に整頓してから振る舞いを変更するほうが安価なこともある)</li>
<li>ある種類の変更の結合を減らせば減らすほど、別の種類の変更に伴う結合が大きくなる</li>
<li>「私たちはトレードオフ空間にいる」</li>
<li>どれとどれが結合しているかという情報は不完全で、変化する</li>
<li>先に整頓するかに影響をあたえる要素
<ul class="org-ul">
<li>コスト</li>
<li>収益</li>
<li>結合: 整頓によってより少ない要素の変更になるか</li>
<li>凝集: 整頓によって変更が必要な要素がより小さく、もっと集中した範囲になるか</li>
</ul></li>
<li>『時を超えた建設の道』</li>
<li>『形の合成に関するノート』</li>
</ul>
</div>
</div>
<div id="outline-container-orgeae9630" class="outline-2">
<h2 id="orgeae9630"><a href="#orgeae9630">関連</a></h2>
<div class="outline-text-2" id="text-orgeae9630">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
